Repository: Hagag9/MeLink.Web
Catalog: MeLink.Web/Resources/Views/Home/Index.*.resx
Languages: ar

source: Your Health, Our Priority
ar: صحتك أولويتنا

# FindAndOrder
source: Find and order your medicines from trusted pharmacies and suppliers with ease. MeLink connects you directly to the care you need, fast.
ar: ابحث عن أدويتك واطلبها من الصيدليات والموردين الموثوق بهم بسهولة. MeLink يوصلك مباشرة بالرعاية التي تحتاجها، بسرعة.

source: Start Your Order
ar: ابدأ طلبك

source: Learn More
ar: اعرف المزيد

source: How It Works
ar: كيف يعمل

# SimpleSteps
source: Simple steps to get your medicines delivered to your door.
ar: خطوات بسيطة للحصول على أدويتك حتى باب منزلك.

# SearchStep
source: 1. Search
ar: ١. ابحث

# SearchStepDescription
source: Find the medicine you need by name or active ingredient.
ar: ابحث عن الدواء الذي تحتاجه بالاسم أو المادة الفعالة.

# OrderStep
source: 2. Order
ar: ٢. اطلب

# OrderStepDescription
source: Choose from a list of available suppliers and place your order.
ar: اختر من قائمة الموردين المتاحين وقم بتقديم طلبك.

# ReceiveStep
source: 3. Receive
ar: ٣. استلم

# ReceiveStepDescription
source: Get your medicines delivered directly to your doorstep.
ar: احصل على أدويتك مباشرة حتى باب منزلك.

source: Our Partners
ar: شركاؤنا

# BrowsePartners
source: Browse our network of trusted suppliers and pharmacies.
ar: تصفح شبكتنا من الموردين والصيدليات الموثوق بهم.

source: Warehouses
ar: المخازن

# WarehousesDescription
source: A wide selection of medicines and bulk supplies.
ar: مجموعة واسعة من الأدوية والمستلزمات بالجملة.

source: Companies
ar: الشركات

# CompaniesDescription
source: Efficient and reliable distribution of medical goods.
ar: توزيع فعال وموثوق للمستلزمات الطبية.

source: Manufacturers
ar: المصنعون

# ManufacturersDescription
source: Direct access to a wide range of products.
ar: وصول مباشر إلى مجموعة واسعة من المنتجات.

source: Pharmacies
ar: الصيدليات

# PharmaciesDescription
source: Get your prescribed medicines from local pharmacies.
ar: احصل على أدويتك الموصوفة من الصيدليات المحلية.
