Repository: Hagag9/MeLink.Web
Catalog: MeLink.Web/Resources/Views/Order/CreatePrescriptionOrder.*.resx
Languages: ar

source: Order with Prescription
ar: طلب بوصفة طبية

source: From:
ar: من:

source: Please upload your prescription file. The pharmacy will contact you to confirm the order details and payment.
ar: يرجى تحميل ملف الوصفة الطبية الخاص بك. ستتصل بك الصيدلية لتأكيد تفاصيل الطلب والدفع.

source: Prescription File
ar: ملف الوصفة الطبية

source: Choose File
ar: اختر ملف

source: No file chosen
ar: لم يتم اختيار ملف

source: Notes
ar: ملاحظات

source: Any special instructions or details for the pharmacy...
ar: أي تعليمات خاصة أو تفاصيل للصيدلية ...

source: Submit Prescription
ar: إرسال الوصفة الطبية

source: Back to options
ar: العودة إلى الخيارات
