Repository: Hagag9/MeLink.Web
Catalog: MeLink.Web/Resources/Controllers/OrderController.*.resx
Languages: ar_sa

source: Your prescription has been sent successfully!
ar_sa: تم إرسال وصفتك الطبية بنجاح!

source: Not allowed
ar_sa: غير مسموح

source: The medicine is not available in the required quantity
ar_sa: الدواء غير متوفر بالكمية المطلوبة

source: There are no medicines in the order
ar_sa: لا توجد أدوية في الطلب

source: An item was found without a source. The order could not be processed.
ar_sa: تم العثور على عنصر بدون مصدر. تعذر معالجة الطلب.

source: The medicine '{0}' is not available in the required quantity
ar_sa: الدواء '{0}' غير متوفر بالكمية المطلوبة

source: {0} orders have been created successfully!
ar_sa: تم إنشاء {0} طلبات بنجاح!

source: An error occurred while creating the order: {0}
ar_sa: حدث خطأ أثناء إنشاء الطلب: {0}

source: Order not found.
ar_sa: لم يتم العثور على الطلب.

source: This order can no longer be cancelled.
ar_sa: لم يعد من الممكن إلغاء هذا الطلب.

source: Order #{0} has been successfully cancelled.
ar_sa: تم إلغاء الطلب رقم {0} بنجاح.

source: An error occurred while cancelling the order.
ar_sa: حدث خطأ أثناء إلغاء الطلب.

source: This order has already been processed.
ar_sa: تمت معالجة هذا الطلب بالفعل.

source: Order #{0} has been successfully approved.
ar_sa: تمت الموافقة على الطلب رقم {0} بنجاح.

source: An error occurred while approving the order: {0}
ar_sa: حدث خطأ أثناء الموافقة على الطلب: {0}
